# ======= Мой источник информации =======
MY_SOURCE_TEXT = 'Источник: https://t.me/jobzakupki'

# ========= HELP TEXT =========
HELP_TEXT = f'Это бот раздела "Закупочный хаб ProЗакупки".\n\n' \
            f'Он поможет в размещении вакансии или резюме, ' \
            f'а также через него можно связаться с администрацией канала.\n' \
            f'Ну и вообще сделать все что надо.\n\nНаши каналы:\n- Новости Интерфакса ' \
            f'по закупкам https://t.me/InterfaxProZakupkiNews\n- Работа и Карьера в закупках:' \
            f' Вакансии & Кандидаты https://t.me/jobzakupki\n\nЕсли вдруг бот не запускается,' \
            f' воспользуйтесь командой /start, после чего внизу возникнут кнопки ЗАПУСК ' \
            f'(основная часть функционала) и ПОМОЩЬ'

# ========= Текст для размещения резюме и вакансии =========
FOR_POST_RESUME_TEXT = f'Для размещения резюме введите ниже его текст. \n\n' \
                       f'В тексте можно использовать символы разметки Markdown \n ' \
                       f' \*bold text\* (*выделение жирным*) \n ' \
                       f' \_italic text\_ (_курсив_) \n  \[text](URL) ' \
                       f'(для размещения ссылки) \n\nЕсли хотите прикрепить файл - ' \
                       f'то сможете это сделать после размещения текстового сообщения, ' \
                       f'в рамках его обсуждения.'


FOR_POST_VACANCY_TEXT = f'Для размещения вакансии введите ниже ее описание, указав:\n' \
                        f'- организацию,\n- город,\n- должность, требования к соискателю ' \
                        f'и его обязанности,\n- ожидаемое вознаграждение,\n' \
                        f'-контакты для связи. \n\nВ описании можно использовать символы ' \
                        f'разметки Markdown \n  \*bold text\* (*выделение жирным*)\n ' \
                        f' \_italic text\_ (_курсив_)\n  \[text](URL) ' \
                        f'(для размещения ссылки)\n\nЕсли хотите прикрепить файл - ' \
                        f'то сможете это сделать после размещения текстового сообщения, ' \
                        f'в рамках его обсуждения.'

NO_FORWARD_TEXT = "Вы не можете форвардить сюда (пересылать чужие сообщения). Только" \
                  " свои предложения.\n Нажмите /start для открытия основного меню."




